MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/FlyRf_Base_26_07_22_03/System.cpp
/*
  Модуль System.cpp
  Назначение:
  - Главный координатор проекта, который собирает все подсистемы в единый цикл.

  Основные задачи модуля:
  - Выполнять последовательную инициализацию модулей при старте.
  - Обслуживать основной loop: GNSS, RF, WEB, дисплей, вывод, мосты и сервисные функции.
  - Поддерживать режимы теста, локальные координаты и общую логику времени/обновления.
*/

#include <Arduino.h>
#include <cstring>
#include <cmath>
#include <TimeLib.h>
#include <esp_ota_ops.h>
#include <esp_err.h>
#include "System.h"
#include "TrafficDB.h"
#include "ESP32RF.h"
#include "RF.h"
#include "Log.h"
#include "NMEA.h"
#include "RP2040Bridge.h"
#include "ADSBReceiverESP32.h"
#include "EEPROMRF.h"
#include "WiFiRF.h"
#include "WebRF.h"
#include "LANRF.h"
#include "DeviceInfo.h"
#include "OTA.h"
#include "RS485Display.h"
#include "FlyRfSpi.h"
#include "GNSS.h"
#include "Baro.h"
#include "Bluetooth.h"
#include "Tracker.h"
#include "Mavlink.h"

// Arduino-ESP32 normally confirms a new OTA image before setup() starts.
// Defer confirmation until FlyRF completes setup and runs stably.
extern "C" bool verifyRollbackLater()
{
    return true;
}

namespace
{
    static bool g_otaPendingVerification = false;
    static bool g_otaBootConfirmed = true;
    static uint32_t g_otaVerificationStartMs = 0;
    static uint32_t g_otaLastConfirmAttemptMs = 0;
    static uint32_t g_healthyLoopCount = 0;
    constexpr uint32_t kOtaConfirmationDelayMs = 15000UL;
    constexpr uint32_t kOtaRequiredLoopCount = 100UL;

    static void beginOtaStartupVerification()
    {
        const esp_partition_t* running = esp_ota_get_running_partition();
        esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
        g_otaPendingVerification = running &&
            esp_ota_get_state_partition(running, &state) == ESP_OK &&
            state == ESP_OTA_IMG_PENDING_VERIFY;
        g_otaBootConfirmed = !g_otaPendingVerification;
        g_otaVerificationStartMs = millis();
        g_healthyLoopCount = 0;

        if (g_otaPendingVerification)
            Serial.println(F("[OTA] New firmware pending verification; stability test started"));
        else
            Serial.println(F("[OTA] Running firmware is already confirmed"));
    }

    static void serviceOtaStartupVerification()
    {
        if (!g_otaPendingVerification) return;
        ++g_healthyLoopCount;
        const uint32_t now = millis();
        if ((uint32_t)(now - g_otaVerificationStartMs) < kOtaConfirmationDelayMs ||
            g_healthyLoopCount < kOtaRequiredLoopCount ||
            (uint32_t)(now - g_otaLastConfirmAttemptMs) < 1000UL)
            return;

        g_otaLastConfirmAttemptMs = now;
        const esp_err_t result = esp_ota_mark_app_valid_cancel_rollback();
        if (result == ESP_OK)
        {
            g_otaPendingVerification = false;
            g_otaBootConfirmed = true;
            Serial.println(F("[OTA] Startup verified; new firmware confirmed"));
        }
        else
        {
            Serial.printf("[OTA] Confirmation failed: %s\r\n", esp_err_to_name(result));
        }
    }

    struct SimTrafficState
    {
        bool active;
        uint32_t addr;
        int squawk;
        char callsign[8];
        double latitude;
        double longitude;
        int16_t offsetSteps;
        int8_t direction;
        uint32_t lastStepMs;
        uint32_t startDelayMs;
    };

    static uint32_t g_lastOwnshipTxMs = 0;
    static uint8_t g_lastModeApplied = 0xFFU;
    static float g_lastModeBaseLat = 9999.0f;
    static float g_lastModeBaseLon = 9999.0f;
    static int16_t g_testFlightOffsetSteps = 0;
    static int8_t g_testFlightDirection = 1;
    static uint32_t g_lastTestFlightStepMs = 0;
    static SimTrafficState g_simTraffic[5] = {};
    static uint32_t g_testTrafficEpochMs = 0;
    static bool g_simTrafficWasActive = false;
    static uint16_t g_testDisplayCourseDeg = 0U;
    static uint32_t g_lastTestDisplayCourseStepMs = 0U;

    constexpr double kEarthRadiusMeters = 6371000.0;
    constexpr float kTestTrackOwnForwardCourseDeg = 70.0f;
    constexpr float kTestTrackStepMeters = 500.0f;
    constexpr int16_t kTestTrackLimitSteps = 40;
    constexpr float kTestTrackSpeedKnots = ((kTestTrackStepMeters / 1852.0f) * 3600.0f) * 0.5f;
    constexpr uint32_t kMotionStepPeriodMs = 2000UL;
    constexpr float kSimTrafficInitialCourseDeg = 40.0f;
    constexpr float kSimTrafficCourseStepDeg = 20.0f;
    constexpr uint32_t kSimTrafficAsyncDelayMs = 5000UL;
    constexpr uint32_t kTestDisplayCourseStepPeriodMs = 3000UL;
    constexpr uint16_t kTestDisplayCourseStepDeg = 5U;
    constexpr float kSimAltitudeMinMeters = 1000.0f;
    constexpr float kSimAltitudeMaxMeters = 8000.0f;
    constexpr float kTestOwnshipAltitudeMeters = 3000.0f;
    constexpr float kDefaultTestBaseLat = 50.0000f;
    constexpr float kDefaultTestBaseLon = 8.0000f;
    constexpr uint32_t kSimAltitudeHalfPeriodMs = 700000UL;
    constexpr uint32_t kSimAltitudeFullPeriodMs = kSimAltitudeHalfPeriodMs * 2UL;
    constexpr size_t kSimTrafficCount = sizeof(g_simTraffic) / sizeof(g_simTraffic[0]);
    constexpr size_t kSimAltitudeProfileCount = kSimTrafficCount + 1U;

    static const uint32_t kSimTrafficAddresses[kSimTrafficCount] = {
        0x0F1111UL, 0x0F2222UL, 0x0F3333UL, 0x0F4444UL, 0x0F5555UL
    };

    static const int kSimTrafficSquawks[kSimTrafficCount] = {
        1521, 1522, 1523, 1524, 1525
    };

    static const char* const kSimTrafficCallsigns[kSimTrafficCount] = {
        "AFL1111", "AFL2222", "AFL3333", "AFL4444", "AFL5555"
    };

    static double deg2rad(double value)
    {
        return value * 0.017453292519943295769236907684886;
    }

    static double rad2deg(double value)
    {
        return value * 57.295779513082320876798154814105;
    }

    static float normalizeCourse360(float value)
    {
        while (value >= 360.0f) value -= 360.0f;
        while (value < 0.0f) value += 360.0f;
        return value;
    }

    static void advanceDisplayCourseStep(uint32_t nowMs)
    {
        while ((uint32_t)(nowMs - g_lastTestDisplayCourseStepMs) >= kTestDisplayCourseStepPeriodMs)
        {
            g_lastTestDisplayCourseStepMs += kTestDisplayCourseStepPeriodMs;
            g_testDisplayCourseDeg = (uint16_t)((g_testDisplayCourseDeg + kTestDisplayCourseStepDeg) % 360U);
        }
    }

    static void fillCallsign(char* dst, size_t dstSize, const char* src)
    {
        if (dst == nullptr || dstSize == 0)
        {
            return;
        }

        memset(dst, ' ', dstSize);
        if (src == nullptr)
        {
            return;
        }

        const size_t srcLen = strlen(src);
        const size_t copyLen = (srcLen < dstSize) ? srcLen : dstSize;
        memcpy(dst, src, copyLen);
    }

    static void projectCoordinate(double startLatDeg, double startLonDeg, float bearingDeg, double distanceMeters,
                                  float& outLatDeg, float& outLonDeg)
    {
        if (distanceMeters == 0.0)
        {
            outLatDeg = (float)startLatDeg;
            outLonDeg = (float)startLonDeg;
            return;
        }

