MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/FlyRf_Base_26_07_22_03/System.cpp
        const double angularDistance = distanceMeters / kEarthRadiusMeters;
        const double bearingRad = deg2rad((double)bearingDeg);
        const double lat1 = deg2rad(startLatDeg);
        const double lon1 = deg2rad(startLonDeg);
        const double sinLat1 = sin(lat1);
        const double cosLat1 = cos(lat1);
        const double sinAd = sin(angularDistance);
        const double cosAd = cos(angularDistance);

        const double lat2 = asin(sinLat1 * cosAd + cosLat1 * sinAd * cos(bearingRad));
        const double lon2 = lon1 + atan2(sin(bearingRad) * sinAd * cosLat1,
                                         cosAd - sinLat1 * sin(lat2));

        outLatDeg = (float)rad2deg(lat2);
        outLonDeg = (float)rad2deg(lon2);

        while (outLonDeg > 180.0f) outLonDeg -= 360.0f;
        while (outLonDeg < -180.0f) outLonDeg += 360.0f;
    }

    static time_t currentSystemSeconds()
    {
        const time_t t = now();
        return (t > 0) ? t : (time_t)(millis() / 1000UL);
    }

    static bool ownshipHasAnyCoordinates()
    {
        return (ThisAircraft.latitude != 0.0f || ThisAircraft.longitude != 0.0f ||
                ThisAircraft.old_latitude != 0.0f || ThisAircraft.old_longitude != 0.0f);
    }

    static void resolveTestBaseCoordinates(float& baseLat, float& baseLon)
    {
        if (fabsf(baseLat) > 0.00001f || fabsf(baseLon) > 0.00001f)
        {
            return;
        }

        baseLat = kDefaultTestBaseLat;
        baseLon = kDefaultTestBaseLon;
    }

    static void refreshOwnshipTimestamp()
    {
        ThisAircraft.timestamp = currentSystemSeconds();
    }

    static void applyOwnshipIdentity(uint8_t mode)
    {
        if (FlyRfMode_usesLocalCoordinates(mode))
        {
            ThisAircraft.squawk = 1110;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "TEST001");
            ThisAircraft.aircraft_type = AIRCRAFT_TYPE_JET;
        }
        else
        {
            ThisAircraft.squawk = 1111;
            fillCallsign(ThisAircraft.callsign, sizeof(ThisAircraft.callsign), "FlyRF");
            ThisAircraft.aircraft_type = settings ? settings->aircraft_type : AIRCRAFT_TYPE_UNKNOWN;
        }
    }

    static bool advanceMotionStep(uint32_t nowMs, uint32_t& lastStepMs, int16_t& offsetSteps, int8_t& direction)
    {
        bool changed = false;
        while ((uint32_t)(nowMs - lastStepMs) >= kMotionStepPeriodMs)
        {
            lastStepMs += kMotionStepPeriodMs;
            offsetSteps = (int16_t)(offsetSteps + direction);
            if (offsetSteps >= kTestTrackLimitSteps)
            {
                offsetSteps = kTestTrackLimitSteps;
                direction = -1;
            }
            else if (offsetSteps <= -kTestTrackLimitSteps)
            {
                offsetSteps = -kTestTrackLimitSteps;
                direction = 1;
            }
            changed = true;
        }
        return changed;
    }

    static void computeTrackPosition(float baseLat, float baseLon, float forwardCourseDeg,
                                     int16_t offsetSteps, int8_t direction,
                                     float& outLat, float& outLon, float& outCourse, float& outSpeed)
    {
        const float reverseCourseDeg = normalizeCourse360(forwardCourseDeg + 180.0f);
        const float legBearing = (offsetSteps >= 0) ? forwardCourseDeg : reverseCourseDeg;
        const double distanceMeters = fabs((double)offsetSteps) * (double)kTestTrackStepMeters;
        projectCoordinate((double)baseLat, (double)baseLon, legBearing, distanceMeters, outLat, outLon);
        outCourse = (direction >= 0) ? forwardCourseDeg : reverseCourseDeg;
        outSpeed = kTestTrackSpeedKnots;
    }

    static void computeSimulatedAltitude(uint32_t nowMs, size_t profileIndex,
                                         float& outAltitude, float& outPressureAltitude,
                                         int& outVertRate, float& outVs)
    {
        const float altitudeRange = kSimAltitudeMaxMeters - kSimAltitudeMinMeters;
        if (altitudeRange <= 0.0f || kSimAltitudeHalfPeriodMs == 0UL || kSimAltitudeFullPeriodMs == 0UL)
        {
            outAltitude = kSimAltitudeMinMeters;
            outPressureAltitude = kSimAltitudeMinMeters;
            outVertRate = 0;
            outVs = 0.0f;
            return;
        }

        const size_t normalizedProfile = (kSimAltitudeProfileCount > 0U) ? (profileIndex % kSimAltitudeProfileCount) : 0U;
        const uint32_t phaseMs = (uint32_t)(((uint64_t)normalizedProfile * (uint64_t)kSimAltitudeFullPeriodMs) /
                                            (uint64_t)kSimAltitudeProfileCount);
        const uint32_t cycleMs = (nowMs + phaseMs) % kSimAltitudeFullPeriodMs;
        const bool climbing = cycleMs < kSimAltitudeHalfPeriodMs;
        const float fraction = climbing ? ((float)cycleMs / (float)kSimAltitudeHalfPeriodMs)
                                        : ((float)(cycleMs - kSimAltitudeHalfPeriodMs) / (float)kSimAltitudeHalfPeriodMs);

        outAltitude = climbing ? (kSimAltitudeMinMeters + altitudeRange * fraction)
                               : (kSimAltitudeMaxMeters - altitudeRange * fraction);
        outPressureAltitude = outAltitude;

        const float verticalSpeedMps = altitudeRange / ((float)kSimAltitudeHalfPeriodMs / 1000.0f);
        const float signedVerticalSpeedMps = climbing ? verticalSpeedMps : -verticalSpeedMps;
        outVs = signedVerticalSpeedMps * (_GPS_FEET_PER_METER * 60.0f);
        outVertRate = (int)lroundf(outVs);
    }

    static void clearSimulatedTrafficEntries()
    {
        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            for (int j = 0; j < MAX_TRACKING_OBJECTS; ++j)
            {
                if (Container[j].addr == kSimTrafficAddresses[i])
                {
                    Container[j] = EmptyFO;
                }
            }
        }
    }

    static void resetTestFlightState(float baseLat, float baseLon, uint8_t mode)
    {
        g_lastModeApplied = mode;
        g_lastModeBaseLat = baseLat;
        g_lastModeBaseLon = baseLon;
        g_testFlightOffsetSteps = 0;
        g_testFlightDirection = 1;
        g_lastTestFlightStepMs = millis();
        g_testTrafficEpochMs = g_lastTestFlightStepMs;
        g_testDisplayCourseDeg = 0U;
        g_lastTestDisplayCourseStepMs = g_lastTestFlightStepMs;
        clearSimulatedTrafficEntries();

