MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/FlyRf_Base_26_07_22_03/System.cpp
        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            g_simTraffic[i].active = false;
            g_simTraffic[i].addr = kSimTrafficAddresses[i];
            g_simTraffic[i].squawk = kSimTrafficSquawks[i];
            fillCallsign(g_simTraffic[i].callsign, sizeof(g_simTraffic[i].callsign), kSimTrafficCallsigns[i]);
            g_simTraffic[i].latitude = baseLat;
            g_simTraffic[i].longitude = baseLon;
            g_simTraffic[i].offsetSteps = 1;
            g_simTraffic[i].direction = 1;
            g_simTraffic[i].lastStepMs = g_testTrafficEpochMs;
            g_simTraffic[i].startDelayMs = (mode == FLYRF_MODE_TXRX_TEST4) ? (uint32_t)(i * kSimTrafficAsyncDelayMs) : 0UL;
        }
    }

    static void serviceSimulatedTraffic(float baseLat, float baseLon, uint8_t mode)
    {
        const bool simulatedTrafficMode = (mode == FLYRF_MODE_TXRX_TEST3 ||
                                           mode == FLYRF_MODE_TXRX_TEST4);
        if (!simulatedTrafficMode)
        {
            if (g_simTrafficWasActive)
            {
                clearSimulatedTrafficEntries();
                g_simTrafficWasActive = false;
            }
            return;
        }

        g_simTrafficWasActive = true;
        const uint32_t nowMs = millis();
        const time_t nowTs = (time_t)(nowMs / 1000UL);

        for (size_t i = 0; i < kSimTrafficCount; ++i)
        {
            SimTrafficState& state = g_simTraffic[i];
            if ((uint32_t)(nowMs - g_testTrafficEpochMs) < state.startDelayMs)
            {
                continue;
            }

            if (!state.active)
            {
                state.active = true;
                state.lastStepMs = g_testTrafficEpochMs + state.startDelayMs;
                state.offsetSteps = 1;
                state.direction = 1;
            }

            advanceMotionStep(nowMs, state.lastStepMs, state.offsetSteps, state.direction);

            float lat = baseLat;
            float lon = baseLon;
            float course = 0.0f;
            float speed = 0.0f;
            float altitude = kSimAltitudeMinMeters;
            float pressureAltitude = kSimAltitudeMinMeters;
            float vs = 0.0f;
            int vertRate = 0;
            const float forwardCourse = normalizeCourse360(kSimTrafficInitialCourseDeg + (float)i * kSimTrafficCourseStepDeg);
            computeTrackPosition(baseLat, baseLon, forwardCourse,
                                 state.offsetSteps, state.direction,
                                 lat, lon, course, speed);
            computeSimulatedAltitude(nowMs, i + 1U, altitude, pressureAltitude, vertRate, vs);
            state.latitude = lat;
            state.longitude = lon;

            ufo_t traffic = EmptyFO;
            traffic.addr = state.addr & 0x00FFFFFFUL;
            traffic.protocol = settings ? settings->rf_protocol : 0U;
            traffic.addr_type = ADDR_TYPE_ICAO;
            traffic.latitude = lat;
            traffic.longitude = lon;
            traffic.altitude = altitude;
            traffic.pressure_altitude = pressureAltitude;
            traffic.course = course;
            traffic.speed = speed;
            traffic.aircraft_type = AIRCRAFT_TYPE_JET;
            traffic.squawk = state.squawk;
            memcpy(traffic.callsign, state.callsign, sizeof(traffic.callsign));
            traffic.vert_rate = vertRate;
            traffic.vs = vs;
            traffic.timestamp = nowTs;
            traffic.timemsg = nowTs;
            traffic.seen = nowTs;
            traffic.rssi_LoRa = 0;
            traffic.rssi = 0;
            traffic.snr = 0.0f;
            traffic.signal_source = TRAFFIC_SOURCE_FLARM_LORA;
            traffic.source = TRAFFIC_SOURCE_FLARM_LORA;
            traffic.valid = true;

            Traffic_Update(&traffic);
            Traffic_Add(&traffic);
        }
    }

    static void applyLocalCoordinateMode()
    {
        if (settings == nullptr)
        {
            return;
        }

        const uint8_t mode = settings->mode;
        float baseLat = settings->local_latitude;
        float baseLon = settings->local_longitude;
        resolveTestBaseCoordinates(baseLat, baseLon);
        const bool needReset = (mode != g_lastModeApplied) ||
                               (fabsf(baseLat - g_lastModeBaseLat) > 0.000001f) ||
                               (fabsf(baseLon - g_lastModeBaseLon) > 0.000001f);
        if (needReset)
        {
            resetTestFlightState(baseLat, baseLon, mode);
        }

        applyOwnshipIdentity(mode);

        float outLat = baseLat;
        float outLon = baseLon;
        float outCourse = 0.0f;
        float outSpeed = 0.0f;
        float outAltitude = kSimAltitudeMinMeters;
        float outPressureAltitude = kSimAltitudeMinMeters;
        float outVs = 0.0f;
        int outVertRate = 0;
        const uint32_t nowMs = millis();

        if (mode == FLYRF_MODE_TXRX_TEST2)
        {
            advanceMotionStep(nowMs, g_lastTestFlightStepMs, g_testFlightOffsetSteps, g_testFlightDirection);
            computeTrackPosition(baseLat, baseLon, kTestTrackOwnForwardCourseDeg,
                                 g_testFlightOffsetSteps, g_testFlightDirection,
                                 outLat, outLon, outCourse, outSpeed);
        }

        // В тестовых режимах курс нашего самолета всегда равен 0,
        // независимо от направления имитации движения.
        outCourse = 0.0f;

        outAltitude = kTestOwnshipAltitudeMeters;
        outPressureAltitude = kTestOwnshipAltitudeMeters;
        outVs = 0.0f;
        outVertRate = 0;

        ThisAircraft.latitude = outLat;
        ThisAircraft.longitude = outLon;
        ThisAircraft.local_latitude = outLat;
        ThisAircraft.local_longitude = outLon;
        ThisAircraft.old_latitude = outLat;
        ThisAircraft.old_longitude = outLon;
        ThisAircraft.altitude = outAltitude;
        ThisAircraft.pressure_altitude = outPressureAltitude;
        ThisAircraft.vert_rate = outVertRate;
        ThisAircraft.course = outCourse;
        ThisAircraft.speed = outSpeed;
        ThisAircraft.hdop = 0;
        ThisAircraft.geoid_separation = 0.0f;

        serviceSimulatedTraffic(baseLat, baseLon, mode);
    }

