MoseychukA/FLARM_ALL/ChatGPT_FlyRF/Arhiv/ESP32_ADSB_1090/FlyRf_Base_26_07_22_03/System.cpp
    static void serviceOwnshipTransmit()
    {
        const uint32_t nowMs = millis();
        if ((uint32_t)(nowMs - g_lastOwnshipTxMs) < 1000UL)
        {
            return;
        }

        g_lastOwnshipTxMs = nowMs;
        refreshOwnshipTimestamp();

        if (settings != nullptr && !FlyRfMode_usesLocalCoordinates(settings->mode))
        {
            applyOwnshipIdentity(settings->mode);
            if (GNSS_coordinatesValid())
            {
                if (ThisAircraft.latitude != 0.0f || ThisAircraft.longitude != 0.0f)
                {
                    ThisAircraft.old_latitude = ThisAircraft.latitude;
                    ThisAircraft.old_longitude = ThisAircraft.longitude;
                }
                RF_TransmitThisAircraft(true);
                return;
            }

            if (ThisAircraft.old_latitude != 0.0f || ThisAircraft.old_longitude != 0.0f)
            {
                ThisAircraft.latitude = ThisAircraft.old_latitude;
                ThisAircraft.longitude = ThisAircraft.old_longitude;
                RF_TransmitThisAircraft(true);
            }
            return;
        }

        if (ownshipHasAnyCoordinates())
        {
            RF_TransmitThisAircraft(true);
        }
    }
}

float SystemDisplayCourseDeg()
{
    return normalizeCourse360(ThisAircraft.course);
}

void SystemSetup()
{
    Serial.println();
    Serial.println(F("Start setup"));
    Serial.print(F("[SETUP] Version: "));
    Serial.println(DeviceInfo_programVersion());

    Log_setup();
    Serial.println(F("[SETUP] Log ready"));

    TrafficDB.init();
    Serial.println(F("[SETUP] Container ready"));

    EEPROM_setup();
    Serial.println(F("[SETUP] EEPROM ready"));

    if (settings != nullptr)
    {
        ThisAircraft.addr = getChipId() & 0x00FFFFFFUL;
        ThisAircraft.squawk = 1111;
        memset(ThisAircraft.callsign, ' ', sizeof(ThisAircraft.callsign));
        memcpy(ThisAircraft.callsign, "FlyRF", 5);
        ThisAircraft.timestamp = 0;
        ThisAircraft.altitude = 0.0f;
        ThisAircraft.pressure_altitude = 0.0f;
        ThisAircraft.speed = 0.0f;
        ThisAircraft.course = 0.0f;
        ThisAircraft.vert_rate = 0;
        ThisAircraft.old_latitude = 0.0f;
        ThisAircraft.old_longitude = 0.0f;
        ThisAircraft.geoid_separation = 0.0f;
        ThisAircraft.hdop = 0;
        ThisAircraft.aircraft_type = settings->aircraft_type;
        applyOwnshipIdentity(settings->mode);
        if (FlyRfMode_usesLocalCoordinates(settings->mode))
        {
            ThisAircraft.latitude = settings->local_latitude;
            ThisAircraft.longitude = settings->local_longitude;
            ThisAircraft.local_latitude = settings->local_latitude;
            ThisAircraft.local_longitude = settings->local_longitude;
            settings->input_coordinates = IMPUT_COORD_MANUAL;
        }
        else
        {
            ThisAircraft.latitude = 0.0f;
            ThisAircraft.longitude = 0.0f;
            ThisAircraft.local_latitude = 0.0f;
            ThisAircraft.local_longitude = 0.0f;
            settings->input_coordinates = IMPUT_COORD_GNSS;
        }
        ThisAircraft.rp2040_gain = settings->threshold_level;
    }
    Serial.printf("[SETUP] Local coordinates: %.5f, %.5f\r\n", settings ? settings->local_latitude : 0.0f, settings ? settings->local_longitude : 0.0f);
    Serial.printf("[SETUP] RP2040 gain: %d\r\n", (int)ThisAircraft.rp2040_gain);

    FlyRfSpiSetup();

    GNSS_setup();
    Serial.println(F("[SETUP] GNSS setup done"));

    Baro_setup();
    Serial.println(F("[SETUP] Baro setup done"));

    if (settings == nullptr || settings->display_enabled)
    {
        Display_setup();
        Serial.println(F("[SETUP] Display ready"));
    }
    else
    {
        Serial.println(F("[SETUP] Display disabled"));
    }

    const byte rfType = RF_setup();
    if (rfType != RF_IC_NONE)
    {
        Serial.println(F("[SETUP] LoRa setup done"));
    }
    else
    {
        Serial.println(F("[SETUP] LoRa module not detected"));
    }

    RP2040Bridge_setup();
    Serial.println(F("[SETUP] RP2040 setup done"));

    ADSBReceiverESP32_setup();
    Serial.println(F("[SETUP] ESP32 ADS-B setup done"));

    if (settings == nullptr || settings->wifi_mode != WIFI_CONTROL_OFF)
    {
        WiFi_setup();
        Serial.println(F("[SETUP] WiFi setup done"));
    }
    else
    {
        WiFi_fini();
        Serial.println(F("[SETUP] WiFi disabled"));
    }

    Web_setup();
    Serial.println(F("[SETUP] Web setup done"));

    if (settings == nullptr || settings->lan_enabled)
    {
        LAN_setup();
        Serial.println(F("[SETUP] LAN setup done"));
    }
    else
    {
        Serial.println(F("[SETUP] LAN disabled"));
    }

    Bluetooth_setup();
    Serial.println(F("[SETUP] Bluetooth setup done"));

    RS485Display_setup();
    Serial.println(F("[SETUP] RS485 setup done"));

    NMEA_setup();
    Serial.println(F("[SETUP] NMEA setup done"));

    Tracker_setup();
    Serial.println(F("[SETUP] Tracker setup done"));

    Mavlink_setup();
    Serial.println(F("[SETUP] MAVLink setup done"));

    OTA_setup();
    Serial.println(F("[SETUP] OTA setup done"));

    beginOtaStartupVerification();
    Serial.println(F("Setup End"));
}

bool SystemOtaPendingVerification()
{
    return g_otaPendingVerification;
}

bool SystemOtaBootConfirmed()
{
    return g_otaBootConfirmed;
}

void SystemEnterOtaMode()
{
    static bool entered = false;
    if (entered)
    {
        return;
    }
    entered = true;

    Serial.println(F("[OTA] Enter service mode"));
    Tracker_fini();
    Mavlink_fini();
    Bluetooth_fini();
    RS485Display_fini();
    NMEA_fini();
    LAN_fini();
    GNSS_fini();
    WiFi_pauseUDP();
}

void SystemLoop()
{
    static uint32_t lastDisplayLoopMs = 0;

    if (Web_otaInProgress())
    {
        WiFi_loop();
        Web_loop();
        OTA_loop();
        delay(0);
        return;
    }

    serviceOtaStartupVerification();

    GNSS_loop();
    Baro_loop();
    if (settings != nullptr && FlyRfMode_usesLocalCoordinates(settings->mode))
    {
        applyLocalCoordinateMode();
    }
    else
    {
        g_lastModeApplied = 0xFFU;
        applyOwnshipIdentity(FLYRF_MODE_NORMAL);
        serviceSimulatedTraffic(settings ? settings->local_latitude : 0.0f,
                                settings ? settings->local_longitude : 0.0f,
                                FLYRF_MODE_NORMAL);
    }
    serviceOwnshipTransmit();
    TrafficDB.removeStale();
    RF_loop();
    ParseData();
    RP2040Bridge_loop();
    ADSBReceiverESP32_loop();
    if (settings == nullptr || settings->wifi_mode != WIFI_CONTROL_OFF)
    {
        WiFi_loop();
    }
    Web_loop();
    if (Web_otaInProgress())
    {
        OTA_loop();
        delay(0);
        return;
    }
    if (settings == nullptr || settings->lan_enabled)
    {
        LAN_loop();
    }
    Tracker_loop();
    Mavlink_loop();
    RS485Display_loop();
    NMEA_loop();
    Bluetooth_loop();
    OTA_loop();

    const uint32_t nowMs = millis();
    if ((uint32_t)(nowMs - lastDisplayLoopMs) >= 300UL)
    {
        lastDisplayLoopMs = nowMs;
        if (settings == nullptr || settings->display_enabled)
        {
            Display_loop();
        }
    }

    delay(1);
}
